ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЖБИ_РасчетПлановыхСтавок/ЖБИ_РасчетПлановыхСтавок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЖБИ_РасчетПлановыхСтавок</name>
  <comment>ЖБИ - Расчет плановых ставок</comment>
  <registerRecords>InformationRegister.ЖБИ_РасчетСтавок</registerRecords>
  <attributes>
    <name>ХозОперкция</name>
    <comment>Хоз. оперкция</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ основание</comment>
    <type>
      <types>DocumentRef.ЖБИ_ЗаявкиПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <comment>Поставщик</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Контрагент</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерЛогист</name>
    <comment>Менеджер логист</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <comment>Бизнес-регион</comment>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОтгрузки</name>
    <comment>Тип отгрузки</comment>
    <type>
      <types>EnumRef.ЖБИ_ТипыОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктОтгрузки</name>
    <comment>Пункт отгрузки</comment>
    <type>
      <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктНазначения</name>
    <comment>Пункт назначения</comment>
    <type>
      <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <comment>Статус</comment>
    <type>
      <types>EnumRef.ЖБИ_СтатусРасчетаСтавки</types>
    </type>
  </attributes>
  <attributes>
    <name>Негабаритный</name>
    <comment>Не габарит</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Расстояние</name>
    <comment>Расстояние</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <comment>Руб. км</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <comment>Сумма с НДС</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопЗатратыНаМатериалы</name>
    <comment>Доп. затр. на материалы</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияДней</name>
    <comment>Срок действия, дней</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияДата</name>
    <comment>Срок действия</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТранспорта</name>
    <comment>Машин на согласование</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаАвто</name>
    <comment>Машин</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДопЗатраты</name>
    <comment>Дополнительные затраты</comment>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <comment>Поставщик</comment>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <comment>Номенклатура поставщика</comment>
      <type>
        <types>CatalogRef.НоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаАвто</name>
      <comment>Норма погрузки</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Негабаритный</name>
      <comment>Не габарит</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийВес</name>
      <comment>Общий вес, т</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазовоеКолвоМашин</name>
      <comment>Базовое кол-во машин</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесВАвто</name>
      <comment> Вес в авто, т</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопРасходыНаРейс</name>
      <comment>Доп. затраты на материалы на 1 рейс с НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_РасчетСтавок/ЖБИ_РасчетСтавок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_РасчетСтавок</name>
  <comment>ЖБИ - Расчет ставок</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидСтавки</name>
    <comment>Вид ставки</comment>
    <type>
      <types>EnumRef.ЖБИ_ВидыСтавок</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействияС</name>
    <comment>Действует с</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействияПо</name>
    <comment>Действует по</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Негабаритный</name>
    <comment>Не габарит</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Расстояние</name>
    <comment>Расстояние</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <comment>Сумма с НДС</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Маршрут</name>
    <comment>Маршрут</comment>
    <type>
      <types>CatalogRef.ЖБИ_Маршрут</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/Enums/ЖБИ_ВидыСтавок/ЖБИ_ВидыСтавок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЖБИ_ВидыСтавок</name>
  <comment>ЖБИ - Виды ставок</comment>
  <enumValues>
    <name>Плановая</name>
    <comment>Плановая</comment>
  </enumValues>
  <enumValues>
    <name>Фактическая</name>
    <comment>Фактическая</comment>
  </enumValues>
</mdclass:Enum>

ЖБИ_УТ11.РасширениеЖБИ/src/Enums/ЖБИ_СтатусЗаявкиПокупателя/ЖБИ_СтатусЗаявкиПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЖБИ_СтатусЗаявкиПокупателя</name>
  <comment>ЖБИ - Статус заявки покупателя</comment>
  <enumValues>
    <name>Новый</name>
    <comment>Новый</comment>
  </enumValues>
  <enumValues>
    <name>ОтправленНаРасчетПлановыхСтавок</name>
    <comment>Отправлен на расчет плановых ставок</comment>
  </enumValues>
  <enumValues>
    <name>РасчетПлановыхСтавок</name>
    <comment>Расчет плановых ставок</comment>
  </enumValues>
  <enumValues>
    <name>ОкончательныйРасчет</name>
    <comment>Окончательный расчет</comment>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеЛогистами</name>
    <comment>Подтверждение логистами</comment>
  </enumValues>
  <enumValues>
    <name>ПодготовкаСчета</name>
    <comment>Подготовка счета</comment>
  </enumValues>
  <enumValues>
    <name>ВыпискаДокументов</name>
    <comment>Выписка документов</comment>
  </enumValues>
  <enumValues>
    <name>ВОтгрузке</name>
    <comment>В отгрузке</comment>
  </enumValues>
  <enumValues>
    <name>ИстекСрокДействия</name>
    <comment>Истек срок действия</comment>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
    <comment>Отгружено</comment>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
    <comment>Завершен</comment>
  </enumValues>
  <enumValues>
    <name>ВАрхиве</name>
    <comment>В архиве</comment>
  </enumValues>
  <enumValues>
    <name>Удален</name>
    <comment>Удален</comment>
  </enumValues>
</mdclass:Enum>

ЖБИ_УТ11.РасширениеЖБИ/src/Catalogs/ЖБИ_Маршрут/ЖБИ_Маршрут.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЖБИ_Маршрут</name>
  <comment>ЖБИ - Маршрут</comment>
  <attributes>
    <name>ПунктОтгрузки</name>
    <comment>Пункт отгрузки</comment>
    <type>
      <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктНазначения</name>
    <comment>Пункт назначения</comment>
    <type>
      <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЖБИ_РасчетПлановыхСтавок/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

Функция РасчитатьСреднююСтавкуПоДопРасходам(ТаблицаДопЗатрат) Экспорт 
	СуммаДоп = 0;
	КолСтр = 0;
	Для Каждого НомСтр Из ТаблицаДопЗатрат Цикл 
		Если НомСтр.ДопРасходыНаРейс=0 Тогда
			Продолжить;
		КонецЕсли;
		КолСтр = КолСтр + 1;
		СуммаДоп = СуммаДоп + НомСтр.ДопРасходыНаРейс;
	КонецЦикла;
	
	ДопЗатраты = ?(КолСтр = 0,0,СуммаДоп/КолСтр);	
	Возврат ДопЗатраты;	
КонецФункции

Функция ВыполнитьКомандуРасчетПлановыхСтавок(Ссылка,СообщениеОбОшибке) Экспорт 
	
	Отказ = Ложь;
	
	//1 создать маршрут
	Маршрут = Справочники.ЖБИ_Маршрут.ПустаяСсылка();
	ПунктОтгрузки = Ссылка.ПунктОтгрузки;
	ПунктНазначения = Ссылка.ПунктНазначения;
	Отказ = Справочники.ЖБИ_Маршрут.СоздатьМаршрутДляРасчетаСтавки(ПунктОтгрузки,ПунктНазначения,Маршрут,СообщениеОбОшибке);
	Если Отказ Тогда 
		Возврат Отказ;
	КонецЕсли;
	
	//2 Делаем запись в регистре ЖБИ_РасчетСтавок 
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Регистратор",Ссылка);
	СтруктураПараметров.Вставить("Период",Ссылка.Дата);
	СтруктураПараметров.Вставить("Активность",Истина);
	СтруктураПараметров.Вставить("Маршрут",Маршрут);
	СтруктураПараметров.Вставить("ВидСтавки",Перечисления.ЖБИ_ВидыСтавок.Плановая);
	СтруктураПараметров.Вставить("СрокДействияС",ТекущаяДатаСеанса());
	СтруктураПараметров.Вставить("СрокДействияПо",Ссылка.СрокДействияДата);
	СтруктураПараметров.Вставить("Негабаритный",Ссылка.Негабаритный);
	СтруктураПараметров.Вставить("Расстояние",Ссылка.Расстояние);
	СтруктураПараметров.Вставить("Сумма",Ссылка.Сумма);
	СтруктураПараметров.Вставить("Автор",Пользователи.ТекущийПользователь());
	ТаблицаНабораЗаписей = РегистрыСведений.ЖБИ_РасчетСтавок.ЗаполнитьТаблицуНабораЗаписей(СтруктураПараметров);
	
	Результат = РегистрыСведений.ЖБИ_РасчетСтавок.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,,, СообщениеОбОшибке);
	Если Не Результат Тогда
		Отказ = Истина;	
	КонецЕсли;
	
	Возврат Отказ;
		
КонецФункции

Функция ИзменитьСтатусЗаявкиПокупателяОкончательныйРасчет(ЗаявкаСсылка,ПредварРасчетСсылка,СообщениеОбОшибке) Экспорт
	
	Отказ = Ложь;	
	ОбъекЗаявка = ЗаявкаСсылка.ПолучитьОбъект();		
	
	//заполнение ставки	
	Для Каждого НомСтр Из ПредварРасчетСсылка.ДопЗатраты Цикл
		СтруктураПараметров = Новый Структура("Пометка,Поставщик,КодСтроки,Номенклатура,ПунктНазначения,ПунктОтгрузки,Негабаритный",Истина,ПредварРасчетСсылка.Партнер,НомСтр.КодСтроки,НомСтр.Номенклатура,ПредварРасчетСсылка.ПунктНазначения,ПредварРасчетСсылка.ПунктОтгрузки,НомСтр.Негабаритный);
		ЖБИ_ОбщийМодульДокументы.РасчитатьСтавкиТЧЗаявки(ОбъекЗаявка.ПредварительныйРасчет,СтруктураПараметров);
	КонецЦикла;
			
	//расчет стоимости
	ТаблРасчет = ОбъекЗаявка.ПредварительныйРасчет.Выгрузить();
	ТаблицаКонтроль = ОбъекЗаявка.КонтрольТранспорта.Выгрузить();
	//ЖБИ_ОбщийМодульДокументы.РасчитатьСтоимость(ЗаявкаСсылка,ТаблРасчет,ТаблицаКонтроль);
	//ОбъекЗаявка.ПредварительныйРасчет.Загрузить(ТаблРасчет);
	
	СтатусЗавершен = Документы.ЖБИ_ЗаявкиПокупателей.МожноПереводитьДокументНаОкончательныйРасчет(ЗаявкаСсылка, ПредварРасчетСсылка);
	Если СтатусЗавершен 
		И ЗаявкаСсылка.Статус = Перечисления.ЖБИ_СтатусЗаявкиПокупателя.ОтправленНаРасчетПлановыхСтавок Тогда 
		ОбъекЗаявка.Статус = Перечисления.ЖБИ_СтатусЗаявкиПокупателя.ОкончательныйРасчет;
		Документы.ЖБИ_ЗаявкиПокупателей.ЗаполнитьТаблицуОкончательныйРасчет(ОбъекЗаявка,ОбъекЗаявка.ПредварительныйРасчет.Выгрузить(Новый Структура("Пометка",Истина)));
	КонецЕсли;
		
	Попытка
		ОбъекЗаявка.Записать();
	Исключение
		СообщениеОбОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Отказ = Истина;
		Возврат Отказ;
	КонецПопытки;
	
	Возврат Отказ;
	
КонецФункции

Функция ИзменитьСтатусЗаявкиПокупателяПредварительныйРасчет(ЗаявкаСсылка,ПредварРасчетСсылка,СообщениеОбОшибке) Экспорт
	
	Отказ = ЖБИ_ОбщийМодульДокументы.ОтклонитьДокументыОснованияЗаявкиПокупателя(ЗаявкаСсылка,ПредварРасчетСсылка,СообщениеОбОшибке);
	Если Отказ Тогда 
		Возврат Отказ;
	КонецЕсли;
	
	Отказ = ЖБИ_ОбщийМодульДокументы.ПеревестиЗаявкуНаПредварительныйРасчет(ЗаявкаСсылка,СообщениеОбОшибке);
	Если Отказ Тогда 
		Возврат Отказ;
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

Процедура ИзменитьСтатусЗаявкиПокупателяОкончательныйРасчетБезДокумента(ОбъекЗаявка) Экспорт 
	
	//расчет стоимости
	ТаблицаРасчет 		= ОбъекЗаявка.ПредварительныйРасчет.Выгрузить();
	ТаблицаКонтроль 	= ОбъекЗаявка.КонтрольТранспорта.Выгрузить();
	ЖБИ_ОбщийМодульДокументы.РасчитатьСтоимость(ОбъекЗаявка.Ссылка,ТаблицаРасчет,ТаблицаКонтроль);
	ОбъекЗаявка.Статус 	= Перечисления.ЖБИ_СтатусЗаявкиПокупателя.ОкончательныйРасчет;
	Документы.ЖБИ_ЗаявкиПокупателей.ЗаполнитьТаблицуОкончательныйРасчет(ОбъекЗаявка,ОбъекЗаявка.ПредварительныйРасчет.Выгрузить());	
	
КонецПроцедуры

#КонецОбласти

#Область Отчеты

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВводОстатковЛокализация.ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
